logs/fio-diskseq/hpk/000/log001.txt
+ kubectl create --context '' namespace bench
namespace/bench created
+ kubectl create -n bench --context '' -f -
persistentvolumeclaim/claim1 created
+ kubectl create -n bench --context '' -f -
job.batch/fio created
+ kubectl wait --context '' --for=condition=complete --timeout=10h job/fio -n bench
job.batch/fio condition met
+ kubectl logs job/fio -n bench --context ''
Defaulted container "fio" out of: fio, init-container-resources (init)
INFO:    Converting SIF file to temporary sandbox...
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-write: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;84956;331;98740;0;0;0.000000;0.000000;72;79864;3007.644039;7244.366027;1.000000%=96;5.000000%=97;10.000000%=97;20.000000%=98;30.000000%=101;40.000000%=108;50.000000%=114;60.000000%=130;70.000000%=177;80.000000%=6848;90.000000%=10813;95.000000%=14614;99.000000%=36962;99.500000%=50069;99.900000%=61603;99.950000%=63700;99.990000%=72876;0%=0;0%=0;0%=0;76;79871;3012.418070;7244.352674;5120;1232896;100.000000%;84971.208122;117001.595034;0.236988%;4.294149%;7197;0;223;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;24.31%;54.50%;0.10%;0.00%;0.00%;0.00%;0.00%;9.50%;8.87%;2.25%;0.48%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;268;1706;0;0;19547;117137;136684;58.16%;slaves;2564;32988;186;3499;209366;342618;577376;98.13%;sda;2564;32988;186;3499;209366;342618;577376;98.13%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=364: Fri Nov 24 20:43:34 2023
  write: IOPS=331, BW=83.0MiB/s (87.0MB/s)(8192MiB/98740msec); 0 zone resets
    clat (usec): min=72, max=79864, avg=3007.64, stdev=7244.37
     lat (usec): min=76, max=79871, avg=3012.42, stdev=7244.35
    clat percentiles (usec):
     |  1.00th=[   97],  5.00th=[   98], 10.00th=[   98], 20.00th=[   99],
     | 30.00th=[  102], 40.00th=[  109], 50.00th=[  115], 60.00th=[  131],
     | 70.00th=[  178], 80.00th=[ 6849], 90.00th=[10814], 95.00th=[14615],
     | 99.00th=[36963], 99.50th=[50070], 99.90th=[61604], 99.95th=[63701],
     | 99.99th=[72877]
   bw (  KiB/s): min= 5120, max=1232896, per=100.00%, avg=84971.21, stdev=117001.60, samples=197
   iops        : min=   20, max= 4816, avg=331.92, stdev=457.04, samples=197
  lat (usec)   : 100=24.31%, 250=54.50%, 500=0.10%
  lat (msec)   : 10=9.50%, 20=8.87%, 50=2.25%, 100=0.48%
  cpu          : usr=0.24%, sys=4.29%, ctx=7197, majf=0, minf=223
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=83.0MiB/s (87.0MB/s), 83.0MiB/s-83.0MiB/s (87.0MB/s-87.0MB/s), io=8192MiB (8590MB), run=98740-98740msec

Disk stats (read/write):
    dm-2: ios=268/1706, merge=0/0, ticks=19547/117137, in_queue=136684, util=58.16%, aggrios=2564/32988, aggrmerge=186/3499, aggrticks=209366/342618, aggrin_queue=577376, aggrutil=98.13%
  sda: ios=2564/32988, merge=186/3499, ticks=209366/342618, in_queue=577376, util=98.13%
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
kube-fio-read: Laying out IO file (1 file / 8192MiB)
3;fio-3.35;kube-fio-read;0;0;8388608;408463;1595;20537;0;0;0.000000;0.000000;34;214253;626.237220;3828.742364;1.000000%=35;5.000000%=36;10.000000%=36;20.000000%=37;30.000000%=37;40.000000%=38;50.000000%=38;60.000000%=39;70.000000%=42;80.000000%=49;90.000000%=62;95.000000%=1875;99.000000%=15400;99.500000%=16056;99.900000%=50593;99.950000%=56885;99.990000%=91750;0%=0;0%=0;0%=0;34;214253;626.290073;3828.740477;180224;507904;99.972634%;408351.219512;84949.892126;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.155824%;12.232178%;2910;0;76;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;80.16%;14.08%;0.01%;0.01%;0.01%;0.02%;1.32%;1.22%;0.82%;2.08%;0.16%;0.11%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-2;2153;11;0;0;72895;315;73210;92.85%;slaves;35168;286;559;9;1057662;10172;1072445;98.64%;sda;35168;286;559;9;1057662;10172;1072445;98.64%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=406: Fri Nov 24 20:46:12 2023
  read: IOPS=1595, BW=399MiB/s (418MB/s)(8192MiB/20537msec)
    clat (usec): min=34, max=214253, avg=626.24, stdev=3828.74
     lat (usec): min=34, max=214253, avg=626.29, stdev=3828.74
    clat percentiles (usec):
     |  1.00th=[   36],  5.00th=[   37], 10.00th=[   37], 20.00th=[   38],
     | 30.00th=[   38], 40.00th=[   39], 50.00th=[   39], 60.00th=[   40],
     | 70.00th=[   43], 80.00th=[   50], 90.00th=[   63], 95.00th=[ 1876],
     | 99.00th=[15401], 99.50th=[16057], 99.90th=[50594], 99.95th=[56886],
     | 99.99th=[91751]
   bw (  KiB/s): min=180224, max=507904, per=99.97%, avg=408351.22, stdev=84949.89, samples=41
   iops        : min=  704, max= 1984, avg=1595.12, stdev=331.84, samples=41
  lat (usec)   : 50=80.16%, 100=14.08%, 250=0.01%, 500=0.01%, 750=0.01%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=1.32%, 4=1.22%, 10=0.82%, 20=2.08%, 50=0.16%
  lat (msec)   : 100=0.11%, 250=0.01%
  cpu          : usr=0.16%, sys=12.23%, ctx=2910, majf=0, minf=76
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=399MiB/s (418MB/s), 399MiB/s-399MiB/s (418MB/s-418MB/s), io=8192MiB (8590MB), run=20537-20537msec

Disk stats (read/write):
    dm-2: ios=2153/11, merge=0/0, ticks=72895/315, in_queue=73210, util=92.85%, aggrios=35168/286, aggrmerge=559/9, aggrticks=1057662/10172, aggrin_queue=1072445, aggrutil=98.64%
  sda: ios=35168/286, merge=559/9, ticks=1057662/10172, in_queue=1072445, util=98.64%
INFO:    Cleaning up image...
+ kubectl delete --context '' namespace bench
namespace "bench" deleted